
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 7 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.appInsights-InstrumentationKey
  * azurerm_resource_group.rg
  * module.fis-kv-vault.azurerm_key_vault.kv
  * module.fis-kv-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.fis-kv-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.fis-kv-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.fis-kv-vault.azurerm_user_assigned_identity.managed_identity[0]
* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsights-InstrumentationKey will be updated in-place
  ~ resource "azurerm_key_vault_secret" "appInsights-InstrumentationKey" {
        id                      = "https://fis-kv-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/c05c9820688e424eb42eed3be35a7b9b"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat"
        name     = "fis-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.appinsights)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "d0583caa-e155-4038-8996-a1854780c905" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.Insights/components/fis-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "fis-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.fis-kv-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-kv-aat"
        name                            = "fis-kv-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fis-kv-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-kv-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.fis-kv-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            # (10 unchanged elements hidden)
            "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-kv-aat/objectId/22e66b72-e6ae-4b3a-a239-b0384287911b"
      ~ key_permissions         = [
            # (4 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            # (2 unchanged elements hidden)
            "Delete",
          + "Recover",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.fis-kv-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-kv-aat|fis-kv-aat"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "fis-kv-aat"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fis-kv-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/fis-aat-mi"
        name                = "fis-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Vars":{}} -->